In [1]:
person, son, girl = 'women', 'Doyin', 'Jas'

In [2]:
person

'women'

In [3]:
son

'Doyin'

In [4]:
girl

'Jas'

In [109]:
_a_number = 234
_a_number

234

In [7]:
list = [1, 2., 3.0, 4, 'hello world']

In [8]:
list

[1, 2.0, 3.0, 4, 'hello world']

In [9]:
type(list)

list

In [108]:
a_dict = {'names': ['Jas', 'Olu', 'Olaide', 'JOjo'], 'Randoms': [1, 2., 3.0, 4, 'hello world']}
a_dict

{'names': ['Jas', 'Olu', 'Olaide', 'JOjo'],
 'Randoms': [1, 2.0, 3.0, 4, 'hello world']}

In [107]:
b_dict = dict(names = ['Jas', 'Olu', 'Olaide', 'JOjo'], Randoms = [1, 2., 3.0, 4, 'hello world'])
b_dict

{'names': ['Jas', 'Olu', 'Olaide', 'JOjo'],
 'Randoms': [1, 2.0, 3.0, 4, 'hello world']}

In [15]:
a_dict.keys()

dict_keys(['names', 'Randoms'])

In [16]:
a_dict.values()

dict_values([['Jas', 'Olu', 'Olaide', 'JOjo'], [1, 2.0, 3.0, 4, 'hello world']])

In [17]:
((23*4)**(5-3))

8464

In [19]:
11**3

1331

In [20]:
290/3

96.66666666666667

In [21]:
290//3

96

In [22]:
290%3

2

In [25]:
print('''This is a list:{} 
This is a dict:{}'''.format(list, a_dict))

This is a list:[1, 2.0, 3.0, 4, 'hello world']
This is a dict:{'names': ['Jas', 'Olu', 'Olaide', 'JOjo'], 'Randoms': [1, 2.0, 3.0, 4, 'hello world']}

In [37]:
print('''Son: "Hello dad how are you"
Dad: "I'm fine son. How was your day"''')

Son: "Hello dad how are you"
Dad: "I'm fine son. How was your day"

In [38]:
cost = 500
price = 1000
people = 90
profit = price * people - cost
profit

89500

In [46]:
a_dict['names']

['Jas', 'Olu', 'Olaide', 'JOjo']

In [47]:
a_dict['names'][1]

'Olu'

In [48]:
a_dict['names'][1].upper()

'OLU'

In [50]:
a_dict['names'][3].capitalize()

'Jojo'

In [51]:
a_dict['names'].upper()

AttributeError: 'list' object has no attribute 'upper'

In [52]:
a_dict['names'][1].lower()

'olu'

In [53]:
1 and 5

5

In [55]:
2 or 3

2

In [56]:
True and False

False

In [57]:
False and True

False

In [58]:
True or False

True

In [59]:
False or True

True

In [60]:
False and False

False

In [61]:
True and True

True

In [62]:
True or True

True

In [63]:
False or False

False

In [64]:
list

[1, 2.0, 3.0, 4, 'hello world']

In [65]:
list.insert(5, 'Baby')

In [66]:
list.append('Bingo')
list

[1, 2.0, 3.0, 4, 'hello world', 'Baby', 'Bingo']

In [67]:
list.remove('Baby')
list.pop(5)
list

[1, 2.0, 3.0, 4, 'hello world']

In [68]:
a_dict

{'names': ['Jas', 'Olu', 'Olaide', 'JOjo'],
 'Randoms': [1, 2.0, 3.0, 4, 'hello world']}

In [69]:
a_dict.get('names')

['Jas', 'Olu', 'Olaide', 'JOjo']

In [71]:
a_dict.get('address', 'unknown')

'unknown'

In [72]:
a_dict['address'] = ['Ojodu', 'Ogba', 'Ikeja', 'Ikoyi', 'V.I']
a_dict

{'names': ['Jas', 'Olu', 'Olaide', 'JOjo'],
 'Randoms': [1, 2.0, 3.0, 4, 'hello world'],
 'address': ['Ojodu', 'Ogba', 'Ikeja', 'Ikoyi', 'V.I']}

In [74]:
a_dict['address']

['Ojodu', 'Ogba', 'Ikeja', 'Ikoyi', 'V.I']

In [77]:
if 'Ojodu' in a_dict['address']:
    print('Ojodu wa o')

Ojodu wa o

In [111]:
for i in a_dict:
    print(a_dict[i])

['Jas', 'Olu', 'Olaide', 'JOjo']
[1, 2.0, 3.0, 4, 'hello world']

In [112]:
for i in a_dict:
    print(i)

names
Randoms

In [116]:
for i in a_dict:
    print(a_dict[i][3])

JOjo
4

In [115]:
for i in a_dict:
    print(a_dict[i][:3])

['Jas', 'Olu', 'Olaide']
[1, 2.0, 3.0]

In [87]:
for i in range(0, 12, 2):
    print(i)

0
2
4
6
8
10

In [93]:
i = 1
result = 1
while i <= 12:
    result *= i
    i += 1
print(result)

479001600

In [89]:
result = 1
i = 1

while i <= 100:
    result *= i # same as result = result * i
    i += 1 # same as i = i+1

print('The factorial(!) of 100 is: {}'.format(result))

The factorial(!) of 100 is: 93326215443944152681699238856266700490715968264381621468592963895217599993229915608941463976156518286253697920827223758251185210916864000000000000000000000000

In [94]:
def emi(loan_amount):
    emi = loan_amount / 12
    print('The Equal Monthly Payment of this loan is ${}'.format(emi))

In [95]:
emi(50000)

The Equal Monthly Payment of this loan is $4166.666666666667

In [96]:
50000/12

4166.666666666667

Next, let's add the interest calculation into the function. Here's the formula used to calculate the EMI for a loan:

<img src="https://i.imgur.com/iKujHGK.png" style="width:240px">

where:

* `P` is the loan amount (principal)
* `n` is the no. of months
* `r` is the rate of interest per month

The derivation of this formula is beyond the scope of this tutorial. See this video for an explanation: https://youtu.be/Coxza9ugW4E .

In [98]:
def EMI(loan_amount, months, rate, down_payment=0):
    principal = loan_amount - down_payment
    loan_EMI = principal * rate *((1+rate)**months)/(((1+rate)**months)-1)
    print('The Equal Monthly Payment of this loan is ${}'.format(loan_EMI))

In [100]:
EMI(1260000, 8*12, 0.1/12, 3e5)

The Equal Monthly Payment of this loan is $14567.19753389219

In [101]:
def EMI(loan_amount, months, rate, down_payment=0):
    principal = loan_amount - down_payment
    loan_EMI = (principal * rate *((1+rate)**months))/(((1+rate)**months)-1)
    print('The Equal Monthly Payment of this loan is ${}'.format(loan_EMI))

In [102]:
EMI(1260000, 8*12, 0.1/12, 3e5)

The Equal Monthly Payment of this loan is $14567.19753389219

In [103]:
def EMI(loan_amount, months, rate, down_payment):
    principal = loan_amount - down_payment
    loan_EMI = (principal * rate *((1+rate)**months))/(((1+rate)**months)-1)
    print('The Equal Monthly Payment of this loan is ${}'.format(loan_EMI))

In [104]:
EMI(1260000, 8*12, 0.1/12, 3e5)

The Equal Monthly Payment of this loan is $14567.19753389219

In [117]:
import pandas as pd
from pandas import Series, DataFrame

In [118]:
list_series = Series([1, 'order', 'test', 0.5, None, True])
list_series

0        1
1    order
2     test
3      0.5
4     None
5     True
dtype: object

In [119]:
list_series[2]

'test'

In [127]:
if 'order' in list_series[1]:
    print('Hi')

Hi

In [129]:
'order' in list_series[:2]

False

In [134]:
list

[1, 2.0, 3.0, 4, 'hello world']

In [137]:
add_index = Series([1, 'order', 'test', 0.5, None], index= [list])
add_index

1                  1
2.0            order
3.0             test
4                0.5
hello world     None
dtype: object

In [138]:
add_index[2.0:]

2.0            order
3.0             test
4                0.5
hello world     None
dtype: object

In [140]:
ww2 = Series([5000, 10000, 23000, 2200, 50000], index=['USA', 'RUSSIA', 'GERMANY', 'BRITAIN', 'JAPAN'])
ww2

USA         5000
RUSSIA     10000
GERMANY    23000
BRITAIN     2200
JAPAN      50000
dtype: int64

In [141]:
ww2>5000

USA        False
RUSSIA      True
GERMANY     True
BRITAIN    False
JAPAN       True
dtype: bool

In [142]:
ww2== 50000

USA        False
RUSSIA     False
GERMANY    False
BRITAIN    False
JAPAN       True
dtype: bool

In [143]:
ww2[ww2== 50000]

JAPAN    50000
dtype: int64

In [144]:
ww2[ww2>5000]

RUSSIA     10000
GERMANY    23000
JAPAN      50000
dtype: int64

In [149]:
5000 in ww2

False

In [148]:
ww2== 5000

USA         True
RUSSIA     False
GERMANY    False
BRITAIN    False
JAPAN      False
dtype: bool

In [150]:
pd.isnull(ww2)

USA        False
RUSSIA     False
GERMANY    False
BRITAIN    False
JAPAN      False
dtype: bool

In [152]:
ww2

USA         5000
RUSSIA     10000
GERMANY    23000
BRITAIN     2200
JAPAN      50000
dtype: int64

In [154]:
ww2[pd.notnull(ww2)]

USA         5000
RUSSIA     10000
GERMANY    23000
BRITAIN     2200
JAPAN      50000
dtype: int64

In [156]:
covid_country = ['Vatican', 'India', 'Russia', 'USA', 'UK']
positive_cases = Series([None, 3000, 2500, 8000, 5500], index = covid_country)
positive_cases

Vatican       NaN
India      3000.0
Russia     2500.0
USA        8000.0
UK         5500.0
dtype: float64

In [157]:
pd.isna(positive_cases)

Vatican     True
India      False
Russia     False
USA        False
UK         False
dtype: bool

In [158]:
positive_cases[pd.isna(positive_cases)]

Vatican   NaN
dtype: float64

In [164]:
pd_dict = dict(name = ['Ayo', 'Seun', 'Olu', 'Bolu'], Age = [29, 24, 35, 8], Sex= ['Female', 'Female', 'Female', 'Male'], Address = ['UK', 'Ireland', 'Ogba', 'Olowu'])
pd_dict

{'name': ['Ayo', 'Seun', 'Olu', 'Bolu'],
 'Age': [29, 24, 35, 8],
 'Sex': ['Female', 'Female', 'Female', 'Male'],
 'Address': ['UK', 'Ireland', 'Ogba', 'Olowu']}

In [167]:
DF = pd.DataFrame(pd_dict)
DF

   name  Age     Sex  Address
0   Ayo   29  Female       UK
1  Seun   24  Female  Ireland
2   Olu   35  Female     Ogba
3  Bolu    8    Male    Olowu

In [177]:
DF.at[1, 'Sex']

'Female'

In [175]:
DF.loc[2]

name          Olu
Age            35
Sex        Female
Address      Ogba
Name: 2, dtype: object

In [174]:
DF.loc[2:]

   name  Age     Sex Address
2   Olu   35  Female    Ogba
3  Bolu    8    Male   Olowu

In [178]:
DF.columns

Index(['name', 'Age', 'Sex', 'Address'], dtype='object')

In [180]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     4 non-null      object
 1   Age      4 non-null      int64
 2   Sex      4 non-null      object
 3   Address  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [182]:
DF['Age'].sum()

96

In [183]:
DF['Age'].mean()

24.0

In [184]:
DF['Age'].cumsum()

0    29
1    53
2    88
3    96
Name: Age, dtype: int64

In [188]:
DF.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [194]:
DF['name'].value_counts()

name
Ayo     1
Seun    1
Olu     1
Bolu    1
Name: count, dtype: int64

In [195]:
DF.name

0     Ayo
1    Seun
2     Olu
3    Bolu
Name: name, dtype: object

In [196]:
DF.head(2)

   name  Age     Sex  Address
0   Ayo   29  Female       UK
1  Seun   24  Female  Ireland

In [197]:
DF.tail(2)

   name  Age     Sex Address
2   Olu   35  Female    Ogba
3  Bolu    8    Male   Olowu

In [198]:
DF[['name', 'Sex']]

   name     Sex
0   Ayo  Female
1  Seun  Female
2   Olu  Female
3  Bolu    Male

In [203]:
DF['Points'] = range(2, 9, 2)
DF.drop(columns= ['Points'], inplace = True)
DF['Points'] = range(2, 9, 2)
DF

   name  Age     Sex  Address  Points
0   Ayo   29  Female       UK       2
1  Seun   24  Female  Ireland       4
2   Olu   35  Female     Ogba       6
3  Bolu    8    Male    Olowu       8

In [206]:
aTuple = 1, 2, 3
a, b, c = aTuple
print(a)
print(b)
print(c)
print(aTuple)

1
2
3
(1, 2, 3)

In [207]:
aple = [1, 2, 3]
a, b, c = aple
print(a)
print(b)
print(c)
print(aple)

1
2
3
[1, 2, 3]

In [208]:
DataFrame({'ussr':['Russia', 'moscow', 'crimea'],'uk':['london', 'wales', 'scotland'],'nigeria':['lagos', 'ogun', 'kano']})

     ussr        uk nigeria
0  Russia    london   lagos
1  moscow     wales    ogun
2  crimea  scotland    kano

In [214]:
DF.reindex(index= ['a', 'b', 'c', 'd'])

  name  Age  Sex Address  Points
a  NaN  NaN  NaN     NaN     NaN
b  NaN  NaN  NaN     NaN     NaN
c  NaN  NaN  NaN     NaN     NaN
d  NaN  NaN  NaN     NaN     NaN

In [212]:
DF

   name  Age     Sex  Address  Points
0   Ayo   29  Female       UK       2
1  Seun   24  Female  Ireland       4
2   Olu   35  Female     Ogba       6
3  Bolu    8    Male    Olowu       8

In [215]:
new_columns = ['First_Name','Age', 'Sex', 'Country/Street', 'Points']

In [219]:
DF2= DF.reindex(columns=new_columns)
DF2

   First_Name  Age     Sex  Country/Street  Points
0         NaN   29  Female             NaN       2
1         NaN   24  Female             NaN       4
2         NaN   35  Female             NaN       6
3         NaN    8    Male             NaN       8